wisteria-1c/Конфигурация/Catalogs/СегментыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СегментыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновляемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенныйРежимРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаПеренесеныНаНовуюСхему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьИспользуемыеПравила</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючДинамическогоПравила</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ФормированиеСегментовКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ФормированиеСегментовКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СпособыДобавленияВСегмент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыДобавленияВСегмент</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПравилам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/СегментыКонтрагентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьСобытия = ПолучитьФункциональнуюОпцию("ИспользоватьСобытия");
	Если НЕ ИспользоватьСобытия Тогда
		МакетСегментов = "СегментыКонтрагентовРозница";
	Иначе
		МакетСегментов = "СегментыКонтрагентов";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СКД = Объект.Ссылка.СхемаКомпоновкиДанных.Получить();
		Если ТипЗнч(СКД) <> Тип("СхемаКомпоновкиДанных") Тогда
			СКД = Справочники.СегментыКонтрагентов.ПолучитьМакет(МакетСегментов);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ИмяШаблонаСКД) Тогда
			ТекущийШаблонСхемыКомпоновкиДанных = Объект.ИмяШаблонаСКД;
		Иначе
			ТекущийШаблонСхемыКомпоновкиДанных = 
				Элементы.ТекущийШаблонСхемыКомпоновкиДанных.СписокВыбора.НайтиПоЗначению("Основная").Значение;
		КонецЕсли;	
	Иначе
		СКД = Справочники.СегментыКонтрагентов.ПолучитьМакет(МакетСегментов);
		ТекущийШаблонСхемыКомпоновкиДанных = 
			Элементы.ТекущийШаблонСхемыКомпоновкиДанных.СписокВыбора.НайтиПоЗначению("Основная").Значение;
	КонецЕсли;
	
	Если ТекущийШаблонСхемыКомпоновкиДанных = "Основная" Тогда

		НоваяСКД = Справочники.СегментыКонтрагентов.ПолучитьМакет(МакетСегментов);
		РаботаССегментами.ОчиститьНастройкиКомпоновкиДанных(НоваяСКД.НастройкиПоУмолчанию);
		РаботаССегментами.СкопироватьНастройкиКомпоновкиДанных(НоваяСКД.НастройкиПоУмолчанию, СКД.НастройкиПоУмолчанию);
		
		НаборСвойств_Справочник_Контрагенты = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Контрагенты");
		НоваяСКД.Параметры.НаборСвойств_Справочник_Контрагенты.Значение = НаборСвойств_Справочник_Контрагенты;
		НоваяСКД.НастройкиПоУмолчанию.ПараметрыДанных.УстановитьЗначениеПараметра("НаборСвойств_Справочник_Контрагенты",
			НаборСвойств_Справочник_Контрагенты);
		
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД);
		
		СКД = НоваяСКД;
		
	КонецЕсли;
	
	АдресТекущейСКД = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);	
	// Исходная СКД заменяется редактируемой СКД
	РаботаССегментами.СкопироватьСхемуКомпоновкиДанных(АдресРедактируемойСхемыКомпоновкиДанных, АдресТекущейСКД);
	
	// Инициализирование компоновщика настроек редактируемой СКД
	ЭтоСозданиеСегмента = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	РаботаССегментами.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, 
		АдресРедактируемойСхемыКомпоновкиДанных,
		ЭтоСозданиеСегмента);
		
	ЗаполнитьПоляТаблицыОтбора();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		ЗаполнитьСвоихКонтрагентов();
		ЗаполнитьСоставПоПравилам();
	КонецЕсли;
	
	РазрешеноРедактированиеСегмента = РаботаССегментами.РазрешеноРедактированиеСегментаКонтрагентов(Объект.Ссылка);
	
	ВвывестиБаннер();

	УправлениеФормой();
	
	КоличествоПодобранныхВручную = СвоиКонтрагенты.Количество();
	КоличествоПодобранныхПоПравилам = СоставКонтрагентовПоПравилам.Количество();
	
	АдаптацияТакси();
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	КоличествоПодобранныхВручную = СвоиКонтрагенты.Количество();
	КоличествоПодобранныхПоПравилам = СоставКонтрагентовПоПравилам.Количество();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаССегментами.ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, 
		АдресРедактируемойСхемыКомпоновкиДанных, АдресТекущейСКД);
		
	ТекущийОбъект.СхемаКомпоновкиДанных =
		Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресТекущейСКД));
		
	ТекущийОбъект.ИмяШаблонаСКД = ТекущийШаблонСхемыКомпоновкиДанных;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ТаблицаКонтрагентов = РеквизитФормыВЗначение("СвоиКонтрагенты", Тип("ТаблицаЗначений"));
	МассивКонтрагентов 	= ТаблицаКонтрагентов.ВыгрузитьКолонку("Контрагент");
	
	Справочники.СегментыКонтрагентов.ОбновитьСоставСегментаВручную(Объект.Ссылка, МассивКонтрагентов);
	
	КоличествоПодобранныхПоПравилам = СоставКонтрагентовПоПравилам.Количество();

	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("Сегмент", Объект.Ссылка);
	ПараметрОповещения.Вставить("Наименование", Объект.Наименование);
	
	Оповестить("СегментКонтрагентов_ПослеЗаписи", ПараметрОповещения, Объект.Ссылка);
	
	РезультатФоновогоЗадания = ФоновоеЗаданиеЗапустить();
	
	Если РезультатФоновогоЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
	ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда 
		ОперацииПослеФормирования();
	Иначе
		Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект, Истина);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Сегмент формируется...'");
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)

	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийШаблонСхемыКомпоновкиДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено И ВыбранноеЗначение <> ТекущийШаблонСхемыКомпоновкиДанных Тогда
		
		ТекстВопроса = НСтр("ru='Текущие настройки будут потеряны. Продолжить?'");
		
		Если ВыбранноеЗначение = "Произвольная" Тогда
			ТекстМассив = Новый Массив;
			ТекстМассив.Добавить(НСтр("ru = 'Схема будет загружена из файла.'"));
			ТекстМассив.Добавить(ТекстВопроса);
			ТекстВопроса = СтрСоединить(ТекстМассив, Символы.НПП);
		КонецЕсли;
		
		ИмяПроцедурыЗавершения = "ТекущийШаблонСхемыКомпоновкиДанныхОбработкаВыбораЗавершение";
		ЗначениеШаблона = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);
		
		ОповещениеПослеВопроса = Новый ОписаниеОповещения(ИмяПроцедурыЗавершения, ЭтотОбъект, ЗначениеШаблона);
		ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновляемыйПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаВыбораПравилПриИзменении(Элемент)
	
	Если СтраницаВыбораПравил = 0 Тогда
		Элементы.СтраницыПравилаСегмента.ТекущаяСтраница = Элементы.СтраницаПравилаОтбора;
	Иначе
		Элементы.СтраницыПравилаСегмента.ТекущаяСтраница = Элементы.СтраницаФормированиеСостава;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроекНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа,
	Параметр)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТипГруппы = Неопределено;
	ТекущиеДанные.Свойство("ТипГруппы", ТипГруппы);
	
	Если Копирование Тогда
		Если ТипГруппы = Неопределено Тогда
			НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение = ТекущиеДанные.ЛевоеЗначение;	
			НовыйЭлементОтбора.Использование = Истина;
			НовыйЭлементОтбора.ВидСравнения = ТекущиеДанные.ВидСравнения;
			НовыйЭлементОтбора.ПравоеЗначение = ТекущиеДанные.ПравоеЗначение; 
		КонецЕсли;
		
		Если ТипГруппы <> Неопределено Тогда
			НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(
				Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ТипГруппы = ТекущиеДанные.ТипГруппы;
		КонецЕсли;
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПеретаскивание(Элемент, ПараметрыПеретаскивания, 
	СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	Если ПараметрыПеретаскивания.Значение.Количество() = 0 
		ИЛИ ТипЗнч(ПараметрыПеретаскивания.Значение[0]) <> Тип("ДанныеФормыЭлементДерева") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДоступноеПравило Из ПараметрыПеретаскивания.Значение Цикл
		УстановитьОтборСервер(ДоступноеПравило.Значение, ДоступноеПравило.ЭтоПараметр, ДоступноеПравило.ТипЗначенияПоля);
	КонецЦикла;
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, 
	СтандартнаяОбработка)
	
	Если ПараметрыПеретаскивания.Значение.Количество() > 0  Тогда
		
		СтандартнаяОбработка = Ложь;
		Для Каждого ДоступноеПравило Из ПараметрыПеретаскивания.Значение Цикл
			Если СтрНайти(Строка(ДоступноеПравило.ЛевоеЗначение), "ПараметрыДанных") > 0 Тогда
				ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Параметр не может участвовать в группе'"));
				Возврат;
			КонецЕсли;
		КонецЦикла;
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки(Элемент)
		
	ЭтоПараметр = СтрНайти(Строка(Элемент.ТекущиеДанные.ЛевоеЗначение), "ПараметрыДанных") > 0;
	Элементы.КомпоновщикНастроекНастройкиОтборКонтекстноеМенюСгруппироватьЭлементыОтбора.Видимость = НЕ ЭтоПараметр;
	Элементы.КомпоновщикНастроекНастройкиОтборКонтекстноеМенюРазгруппировать.Видимость = НЕ ЭтоПараметр;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, 
	СтандартнаяОбработка, Строка, Поле)
	
	Если НЕ РазрешеноРедактированиеСегмента Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыПеретаскивания.Значение.Количество() > 0 
		И ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтандартнаяОбработка = Ложь;
		Для Каждого ДоступноеПравило Из ПараметрыПеретаскивания.Значение Цикл
			Если ДоступноеПравило.ЭтоГруппа Тогда
				ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Выбор;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоляОтбора

&НаКлиенте
Процедура ПоляОтбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ РазрешеноРедактированиеСегмента Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСервер(Элемент.ТекущиеДанные.Значение, Элемент.ТекущиеДанные.ЭтоПараметр,
		Элемент.ТекущиеДанные.ТипЗначенияПоля);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвоиКонтрагенты

&НаКлиенте
Процедура СвоиКонтрагентыПриИзменении(Элемент)
	
	КоличествоПодобранныхВручную = СвоиКонтрагенты.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура СвоиКонтрагентыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для Каждого ВыбранныйКонтрагент Из ВыбранноеЗначение Цикл
		НовыйКонтрагент = СвоиКонтрагенты.Добавить();
		НовыйКонтрагент.Контрагент = ВыбранныйКонтрагент;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвоиКонтрагентыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура СвоиКонтрагентыПослеУдаления(Элемент)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКонтрагентовПоПравилам

&НаКлиенте
Процедура СоставКонтрагентовПоПравиламВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанныеСписка = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанныеСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанныеСписка.Контрагент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбораПриНаведении(Элемент, Строка, Поле)
	
	Если Строка = Неопределено Тогда
		Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбораВыбратьПолеОтбора.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбъектПоляОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.ПолучитьОбъектПоИдентификатору(Строка);
	Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбораВыбратьПолеОтбора.Видимость = Не ОбъектПоляОтбора.Папка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПолеОтбора(Команда)
	
	ТекущаяСтрока = Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора.ТекущаяСтрока;
	ОбъектПоляОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.ПолучитьОбъектПоИдентификатору(
		ТекущаяСтрока);
	ЭтоПараметр = Не ОбъектПоляОтбора.Папка; 

	ТипЗначенияПоля = ОбъектПоляОтбора.ТипЗначения;
	УстановитьОтборСервер(ОбъектПоляОтбора.Поле, ЭтоПараметр, ТипЗначенияПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийИзменить(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьКонтрагентовВручную(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, Элементы.СвоиКонтрагенты);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСегмент(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСКД(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСхемуИзФайлаВыборФайла", ЭтотОбъект);

	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	
	ПараметрыЗагрузки.Диалог.Заголовок 		= НСтр("ru = 'Выбор схемы компоновки данных'");
	ПараметрыЗагрузки.Диалог.Фильтр 		= НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
	ПараметрыЗагрузки.ИдентификаторФормы 	= УникальныйИдентификатор;	
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенныйРежимРедактирования(Команда)
	Элементы.ФормаРасширенныйРежимРедактирования.Пометка = НЕ Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	Объект.РасширенныйРежимРедактирования = Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ЭтоВариантИнтерфейса85 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбораВыбратьПолеОтбора.Отображение =
		ОтображениеКнопки.Текст;
		
	Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора.Ширина = 20;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПоляОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Элементы.КомпоновщикНастроекНастройкиОтбор.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОшибкиФормирования(Знач ДанныеОшибки)
	
	Если ТипЗнч(ДанныеОшибки) = Тип("Структура") Тогда
		КраткоеПредставлениеОшибки = ДанныеОшибки.КраткоеПредставлениеОшибки;
		ПодробноеПредставлениеОшибки = ДанныеОшибки.ПодробноеПредставлениеОшибки;
	Иначе
		КраткоеПредставлениеОшибки = ДанныеОшибки;
		ПодробноеПредставлениеОшибки = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ПодробноеПредставлениеОшибки) Тогда
		Возврат;
	КонецЕсли;
	
	Уровень = УровеньЖурналаРегистрации.Ошибка;
	ИмяСобытия = НСтр("ru = 'Формирование сегмента контрагентов'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень,,Объект.Ссылка,
			ПодробноеПредставлениеОшибки);
	ВызватьИсключение ПодробноеПредставлениеОшибки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийШаблонСхемыКомпоновкиДанныхОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийШаблонСхемыКомпоновкиДанных = ДополнительныеПараметры.ВыбранноеЗначение;
	
	Если ТекущийШаблонСхемыКомпоновкиДанных = "Произвольная" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСхемуИзФайлаВыборФайла", ЭтотОбъект);
		
		ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
		
		ПараметрыЗагрузки.Диалог.Заголовок 		= НСтр("ru = 'Выбор схемы компоновки данных'");
		ПараметрыЗагрузки.Диалог.Фильтр 		= НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
		ПараметрыЗагрузки.ИдентификаторФормы 	= УникальныйИдентификатор;	
		
		ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);
	Иначе
		ИзменитьСхемуНаОсновную();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСервер(ПолеОтбора, ЭтоПараметр, ТипЗначенияПоля)
	
	НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;	
	НовыйЭлементОтбора.Использование = Истина;
	Если ТипЗначенияПоля.СодержитТип(Тип("Число")) Тогда
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ИначеЕсли ТипЗначенияПоля.СодержитТип(Тип("Строка")) Тогда
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	Иначе
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
			
	ОперацииПослеФормирования();
	
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗапустить()
	
	Попытка
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;

		ПараметрыФормированияСегмента = Новый Структура;
		ПараметрыФормированияСегмента.Вставить("Сегмент", Объект.Ссылка);	
		
		РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
			"РаботаССегментами.СформироватьСоставСегментаВФоне", ПараметрыФормированияСегмента,
			ПараметрыВыполнения);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстИсключения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОперацииПослеФормирования() 
	
	РасчетКоличестваИУправлениеФормой();
	ТекстШаблона = НСтр("ru = 'Сегмент успешно сформирован. Подобрано по правилам: %1, добавлено вручную: %2'");
	СтрокаШаблон = СтрШаблон(ТекстШаблона, КоличествоКонтрагентовПоПравилам, КоличествоКонтрагентовВручную);

	КоличествоПодобранныхПоПравилам = СоставКонтрагентовПоПравилам.Количество();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаШаблон);	

КонецПроцедуры

&НаСервере
Процедура РасчетКоличестваИУправлениеФормой()
	РассчитатьКоличествоКонтрагентовВСегменте();
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура РассчитатьКоличествоКонтрагентовВСегменте()
	
	КоличествоКонтрагентовВручную = СвоиКонтрагенты.Количество();
	СоставКонтрагентовПоПравилам.Очистить();
	КонтрагентыПоПравилам = Справочники.СегментыКонтрагентов.ПолучитьСоставСегмента(Объект.Ссылка,
		Перечисления.СпособыДобавленияВСегмент.ПоПравилам);
		
	Для Каждого КонтрагентСегмента Из КонтрагентыПоПравилам Цикл
		НоваяСтрока = СоставКонтрагентовПоПравилам.Добавить();
		НоваяСтрока.Контрагент = КонтрагентСегмента;	
	КонецЦикла;
	
	КоличествоКонтрагентовПоПравилам = СоставКонтрагентовПоПравилам.Количество();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляТаблицыОтбора()
	
	Для Каждого ПолеОтбора Из КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы Цикл
		
		Если Строка(ПолеОтбора.Поле) = "СлужебныеРеквизиты" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка(ПолеОтбора.Поле) = "ПараметрыДанных" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка(ПолеОтбора.Поле) = "События" И ЭтоРозница Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиПервыйУровень = ДоступныеПравила.ПолучитьЭлементы();
		НоваяГруппаПравил = СтрокиПервыйУровень.Добавить();
		НоваяГруппаПравил.Значение = ПолеОтбора.Поле;
		НоваяГруппаПравил.Представление = ПолеОтбора.Заголовок;
		НоваяГруппаПравил.ЭтоГруппа = Истина;
		НоваяГруппаПравил.Картинка = 2;
		
		СтрокиВторойУровень = НоваяГруппаПравил.ПолучитьЭлементы();
		ДобавитьПоляПараметровДанных(СтрокиВторойУровень, НоваяГруппаПравил);

		Для Каждого ПравилоОтбора Из ПолеОтбора.Элементы Цикл
			Если Строка(ПравилоОтбора.Поле) = "ЗаказыПокупателей.СостояниеЗаказНаряда" Тогда
				Продолжить;
			КонецЕсли;
			НовоеПравило = СтрокиВторойУровень.Добавить();
			НовоеПравило.Значение = ПравилоОтбора.Поле;
			НовоеПравило.Представление = ПравилоОтбора.Заголовок;
			НовоеПравило.ЭтоГруппа = Ложь;
			НовоеПравило.Картинка = 5;
			НовоеПравило.ТипЗначенияПоля = ПравилоОтбора.ТипЗначения;
		КонецЦикла;
		
		Если Строка(ПолеОтбора.Поле) = "Реквизиты" Тогда
			ДобавитьДополнительныеРеквизиты(СтрокиВторойУровень);
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиПервыйУровень = ДоступныеПравила.ПолучитьЭлементы();	
	ГруппаКИ = СтрокиПервыйУровень.Добавить();
	ГруппаКИ.Значение = "Адреса";
	ГруппаКИ.Представление = НСтр("ru = 'Адреса (география)'");
	ГруппаКИ.ЭтоГруппа = Истина;
	ГруппаКИ.Картинка = 2;
	
	ГруппаАдреса = ГруппаКИ.ПолучитьЭлементы();
	ДобавитьПоляКонтактнойИнформации(ГруппаАдреса);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляПараметровДанных(ГруппаДобавления, ГруппаРодитель)
	
	ЭлементыПравилОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы;
	ПараметрыПравилОтбора = ЭлементыПравилОтбора[ЭлементыПравилОтбора.Количество() - 1];	
	
	Для Каждого Параметр Из ПараметрыПравилОтбора.Элементы Цикл
		
		Если СтрНайти(Строка(Параметр.Поле), Строка(ГруппаРодитель.Значение)) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеПравилоУточнения = ГруппаДобавления.Добавить();
		НовоеПравилоУточнения.Значение = Параметр.Поле;
		ЗаголовокПравила = Прав(Параметр.Заголовок, СтрДлина(Параметр.Заголовок) - СтрНайти(Параметр.Заголовок, "."));
		НовоеПравилоУточнения.Представление = ЗаголовокПравила;
		НовоеПравилоУточнения.ЭтоГруппа = Ложь;
		НовоеПравилоУточнения.Картинка = 5;
		НовоеПравилоУточнения.ЭтоПараметр = Истина;
		НовоеПравилоУточнения.ТипЗначенияПоля = Параметр.ТипЗначения;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеРеквизиты(ГруппаДобавления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка,
	|	ДополнительныеРеквизитыИСведения.Заголовок,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ФорматСвойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.ПометкаУдаления = ЛОЖЬ
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ
	|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств_Справочник_Контрагенты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДополнительныеРеквизитыИСведения.Заголовок";
	
	НаборСвойств_Справочник_Контрагенты = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Контрагенты");
	Запрос.УстановитьПараметр("НаборСвойств_Справочник_Контрагенты", НаборСвойств_Справочник_Контрагенты);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовоеПравило = ГруппаДобавления.Добавить();
		НовоеПравило.Значение = ПолеОтбораДополнительногоРеквизита(Выборка.Заголовок, Выборка.ТипЗначения,
			Выборка.Ссылка);
		НовоеПравило.Представление = Выборка.Заголовок;
		НовоеПравило.ЭтоГруппа = Ложь;
		НовоеПравило.Картинка = 5;
		НовоеПравило.ТипЗначенияПоля = Выборка.ТипЗначения;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолеОтбораДополнительногоРеквизита(Заголовок, ТипЗначения, Ссылка, УточнениеАдреса = Ложь)
	
	ПолеДопРеквизита = СтрШаблон("Контрагент.%1", Заголовок);
	
	Для Каждого ГруппаПараметров Из КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы Цикл
		
		Если Строка(ГруппаПараметров.Поле) <> "СлужебныеРеквизиты" Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементГруппы Из ГруппаПараметров.Элементы Цикл
			
			Если Строка(ЭлементГруппы.Поле) <> "СлужебныеРеквизиты.Ссылка" Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого РеквизитГруппы Из ЭлементГруппы.Элементы Цикл
				
				Если РеквизитГруппы.Заголовок <> ПолеДопРеквизита 
					ИЛИ РеквизитГруппы.ТипЗначения <> ТипЗначения Тогда
					Продолжить;
				КонецЕсли;
				
				Возврат РеквизитГруппы.Поле; 
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ссылка;
	
КонецФункции

&НаСервере
Процедура ДобавитьПоляКонтактнойИнформации(ГруппаДобавления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Тип,
	|	ВидыКонтактнойИнформации.Ссылка,
	|	ВидыКонтактнойИнформации.Наименование
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
	|	И ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникКонтрагенты)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТипЗнчКИ = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1024));
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			
			НовоеПравило = ГруппаДобавления.Добавить();
			ПредставлениеКИ = Выборка.Наименование;
			НовоеПравило.Значение = ПолеОтбораДополнительногоРеквизита(ПредставлениеКИ, 
				ТипЗнчКИ, 
				Выборка.Ссылка);
			НовоеПравило.Представление = Выборка.Наименование;
			НовоеПравило.ЭтоГруппа = Ложь;
			НовоеПравило.Картинка = 5;
			НовоеПравило.ТипЗначенияПоля = ТипЗнчКИ;
			
			ЭлементыАдреса = НовоеПравило.ПолучитьЭлементы();
			
			НовоеПравило = ЭлементыАдреса.Добавить();
			НовоеПравило.Представление = НСтр("ru = 'Страна'");
			НовоеПравило.ЭтоГруппа = Ложь;
			НовоеПравило.Картинка = 5;
			НовоеПравило.ТипЗначенияПоля = ТипЗнчКИ;
			ЗначениеКИСтрана = Справочники.СегментыКонтрагентов.ЗначениеПараметраСтрана();
			ПредставлениеКИ = СтрШаблон("%1%2", Выборка.Наименование, ЗначениеКИСтрана);	
						
			НовоеПравило.Значение = ПолеОтбораДополнительногоРеквизита(ПредставлениеКИ, 
				ТипЗнчКИ, 
				Выборка.Ссылка);

			НовоеПравило = ЭлементыАдреса.Добавить();
			НовоеПравило.Представление = НСтр("ru = 'Город'");
			НовоеПравило.ЭтоГруппа = Ложь;
			НовоеПравило.Картинка = 5; 
			НовоеПравило.ТипЗначенияПоля = Новый ОписаниеТипов("Строка");
			ЗначениеКИГород = Справочники.СегментыКонтрагентов.ЗначениеПараметраГород();
			ПредставлениеКИ = СтрШаблон("%1%2", Выборка.Наименование, ЗначениеКИГород);		

			НовоеПравило.Значение = ПолеОтбораДополнительногоРеквизита(ПредставлениеКИ, 
				ТипЗнчКИ, 
				Выборка.Ссылка);
				
			НовоеПравило = ЭлементыАдреса.Добавить();
			НовоеПравило.Представление = НСтр("ru = 'Регион'");
			НовоеПравило.ЭтоГруппа = Ложь;
			НовоеПравило.Картинка = 5;
			НовоеПравило.ТипЗначенияПоля = Новый ОписаниеТипов("Строка");
			
			ЗначениеКИРегион = Справочники.СегментыКонтрагентов.ЗначениеПараметраРегион();
			ПредставлениеКИ = СтрШаблон("%1%2", Выборка.Наименование, ЗначениеКИРегион);	
			
			НовоеПравило.Значение = ПолеОтбораДополнительногоРеквизита(ПредставлениеКИ, 
				ТипЗнчКИ, 
				Выборка.Ссылка);
			
		Иначе
			
			НовоеПравило = ГруппаДобавления.Добавить();
			НовоеПравило.Значение = ПолеОтбораДополнительногоРеквизита(Выборка.Наименование, 
				ТипЗнчКИ, 
				Выборка.Ссылка);
			НовоеПравило.Представление = Выборка.Наименование;
			НовоеПравило.ЭтоГруппа = Ложь;
			НовоеПравило.Картинка = 5;
			НовоеПравило.ТипЗначенияПоля = ТипЗнчКИ;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ЗагрузкаСКДИзФайла

&НаСервере
Процедура ЗагрузитьСхемуИзФайлаНаСервере(ТекстФайла)
	
	Попытка
		
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(ТекстФайла);
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		ИзмененаСхемаКомпоновкиДанных(ЭтотОбъект, СхемаКомпоновкиДанных);
		
	Исключение
		
		ИмяСобытия = НСтр("ru = 'Выполнение операции'", ОбщегоНазначения.КодОсновногоЯзыка());
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайлаВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		
		ИзменитьСхемуНаОсновную();
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Файл не был выбран. Схема заменена на основную.'"));	
		Возврат;
		
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекстовыйДокумент", ТекстовыйДокумент);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьСхемуИзФайлаВыборФайлаЗавершение", 
		ЭтотОбъект, 
		ДополнительныеПараметры);
	
	ТекстовыйДокумент.НачатьЧтение(ОповещениеОЗавершении, ВыбранныеФайлы.Имя, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайлаВыборФайлаЗавершение(ДополнительныеПараметры) Экспорт
	
	ТекстовыйДокумент = ДополнительныеПараметры.ТекстовыйДокумент;
	
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	ОчиститьСообщения();
	ЗагрузитьСхемуИзФайлаНаСервере(Текст);

КонецПроцедуры

&НаСервере
Процедура ИзменитьСхемуНаОсновную()
	
	ТекущийШаблонСхемыКомпоновкиДанных = "Основная";
	СКД = Справочники.СегментыКонтрагентов.ПолучитьМакет("СегментыКонтрагентов");
	СКД.НастройкиПоУмолчанию.Отбор.Элементы.Очистить();
	ИзмененаСхемаКомпоновкиДанных(ЭтотОбъект, СКД);
	
КонецПроцедуры

&НаСервере
Процедура ИзмененаСхемаКомпоновкиДанных(Форма, СхемаКомпоновкиДанных)
	
	// Получена схема из конструктора схемы компоновки данных
	Форма.Модифицированность = Истина;
	БылиИзменения = Ложь;
		
	УстановитьСхемуКомпоновкиДанных(Форма.АдресРедактируемойСхемыКомпоновкиДанных, 
		СхемаКомпоновкиДанных, 
		Истина, 
		БылиИзменения);
		
	// Компоновщик настроек инициализируется редактируемой схемой
	РаботаССегментами.ИнициализироватьКомпоновщикНастроек(Форма.КомпоновщикНастроек,
		Форма.АдресРедактируемойСхемыКомпоновкиДанных);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСхемуКомпоновкиДанных(АдресПриемник, АдресСхемаИсточник, ПроверятьНаИзменение = Ложь,
	БылиИзменения = Ложь)
	
	Если ЭтоАдресВременногоХранилища(АдресСхемаИсточник) Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемаИсточник);
	Иначе
		СхемаКомпоновкиДанных = АдресСхемаИсточник;
	КонецЕсли;
	
	Если ПроверятьНаИзменение Тогда
		
		БылиИзменения = Ложь;
		
		Если ЭтоАдресВременногоХранилища(АдресПриемник) Тогда
			
			ТекущаяСКД = ПолучитьИзВременногоХранилища(АдресПриемник);
			БылиИзменения = ТипЗнч(ТекущаяСКД) = Тип("СхемаКомпоновкиДанных") 
				И РаботаССегментами.ПолучитьXML(СхемаКомпоновкиДанных) <> РаботаССегментами.ПолучитьXML(ТекущаяСКД);	
		Иначе
			
			БылиИзменения = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресПриемник) Тогда
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресПриемник);
	Иначе
		АдресПриемник = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСвоихКонтрагентов()
	
	СвоиКонтрагенты.Очистить();
	СоставКонтрагентов = Справочники.СегментыКонтрагентов.ПолучитьСоставСегмента(Объект.Ссылка, 
		Перечисления.СпособыДобавленияВСегмент.Вручную);
	
	Для Каждого Контрагент Из СоставКонтрагентов Цикл
		НоваяСтрока = СвоиКонтрагенты.Добавить();
		НоваяСтрока.Контрагент = Контрагент;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставПоПравилам()
	
	СоставКонтрагентовПоПравилам.Очистить();
	СоставКонтрагентов = Справочники.СегментыКонтрагентов.ПолучитьСоставСегмента(Объект.Ссылка, 
		Перечисления.СпособыДобавленияВСегмент.ПоПравилам);
	
	Для Каждого Контрагент Из СоставКонтрагентов Цикл
		НоваяСтрока = СоставКонтрагентовПоПравилам.Добавить();
		НоваяСтрока.Контрагент = Контрагент;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	ТолькоПросмотр = НЕ РазрешеноРедактированиеСегмента;
	Элементы.Обновить.Доступность = РазрешеноРедактированиеСегмента;
	Элементы.ГруппаВажныеСообщения.Видимость = Не РазрешеноРедактированиеСегмента;
	Элементы.ФормаРасширенныйРежимРедактирования.Пометка = Объект.РасширенныйРежимРедактирования;

	Если Объект.РасширенныйРежимРедактирования Тогда
		Элементы.СтраницыОтбор.ОтображениеСтраниц = ОтображениеСтраницФормы.Авто;
	Иначе
		Элементы.СтраницыОтбор.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	Элементы.ГруппаРасширенныйРежим.Видимость			= Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	Элементы.ГруппаРасширенныеПоляОтбора.Видимость			= Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	Элементы.ГруппаПользовательскиеПоляОтбора.Видимость		= НЕ Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	Элементы.СтраницаПараметры.Видимость = Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	
	Элементы.ГруппаОтборПользовательскийРежим.Видимость		= НЕ Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	
	Если Элементы.ФормаРасширенныйРежимРедактирования.Пометка Тогда
		Элементы.Переместить(Элементы.КомпоновщикНастроекНастройкиОтбор, Элементы.ОтборРасширенныйРежим);	
	Иначе
		Элементы.Переместить(Элементы.КомпоновщикНастроекНастройкиОтбор, Элементы.ГруппаОтборПользовательскийРежим);
	КонецЕсли;

	Элементы.ДекорацияСостояниеФормированияПоПравилам.Заголовок = ЗаголовокГруппыПодборВСегментПоПравилам();
	
КонецПроцедуры

&НаСервере
Функция ЗаголовокГруппыПодборВСегментПоПравилам()
	
	Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		Уточнение = НСтр("ru = 'правила не выбраны'");
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФормированиеСегментовКонтрагентов.Сегмент КАК Сегмент,
		|	ФормированиеСегментовКонтрагентов.ДатаПоследнегоФормирования КАК ДатаПоследнегоФормирования
		|ИЗ
		|	РегистрСведений.ФормированиеСегментовКонтрагентов КАК ФормированиеСегментовКонтрагентов
		|ГДЕ
		|	ФормированиеСегментовКонтрагентов.Сегмент = &Сегмент";
		
		Запрос.УстановитьПараметр("Сегмент", Объект.Ссылка); 
		Выборка = Запрос.Выполнить().Выбрать();
		ДатаОбновления = Дата(1, 1, 1, 0, 0, 0);
		
		Пока Выборка.Следующий() Цикл
			ДатаОбновления = Выборка.ДатаПоследнегоФормирования;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДатаОбновления) Тогда
			Уточнение = СтрШаблон(НСтр("ru = 'сформирован %1, %2'"), СтрокаДаты(ДатаОбновления),
				ПредставлениеОбновления());
		Иначе
			Уточнение = НСтр("ru=' не сформирован'");
		КонецЕсли;

	КонецЕсли;
	
	Результат = СтрШаблон("%1 %2",
		НСтр("ru='Формирование по правилам:'"),
		Уточнение);
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция СтрокаДаты(ДатаОбновления)

	ДатаСтрокой = "";
	Если НачалоДня(ДатаОбновления) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		ДатаСтрокой = СтрШаблон(НСтр("ru = 'сегодня в %1'"), Формат(ДатаОбновления,"ДФ = ЧЧ:мм"));
	Иначе
		ДатаСтрокой = Формат(ДатаОбновления, "ДФ = дд.ММ.гггг ЧЧ:мм");
	КонецЕсли;
	
	Возврат ДатаСтрокой;
	
КонецФункции

&НаСервере
Функция ПредставлениеОбновления()
	Если Объект.Обновляемый Тогда
		Возврат НСтр("ru = 'обновляется раз в сутки'");
	Иначе
		Возврат НСтр("ru = 'не обновляется'");
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ВвывестиБаннер()

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение =
	НСтр("ru = 'Сегмент используется для предоставления скидки. Для редактирования состава сегмента обратитесь к администратору'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Редактирование состава'");
	
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.ГруппаВажныеСообщения.Имя);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
